SushiBits/platform-stm32f3/include/stm32f328xx_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32f3xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt_IRQn)
IRQN_HANDLER(-13, HardFault_IRQn)
IRQN_HANDLER(-12, MemoryManagement_IRQn)
IRQN_HANDLER(-11, BusFault_IRQn)
IRQN_HANDLER(-10, UsageFault_IRQn)
SKIP_HANLDER(-9)
SKIP_HANLDER(-8)
SKIP_HANLDER(-7)
SKIP_HANLDER(-6)
IRQN_HANDLER(-5, SVCall_IRQn)
IRQN_HANDLER(-4, DebugMonitor_IRQn)
SKIP_HANLDER(-3)
IRQN_HANDLER(-2, PendSV_IRQn)
IRQN_HANDLER(-1, SysTick_IRQn)
IRQN_HANDLER(0, WWDG_IRQn)
SKIP_HANLDER(1)
IRQN_HANDLER(2, TAMP_STAMP_IRQn)
IRQN_HANDLER(3, RTC_WKUP_IRQn)
IRQN_HANDLER(4, FLASH_IRQn)
IRQN_HANDLER(5, RCC_IRQn)
IRQN_HANDLER(6, EXTI0_IRQn)
IRQN_HANDLER(7, EXTI1_IRQn)
IRQN_HANDLER(8, EXTI2_TSC_IRQn)
IRQN_HANDLER(9, EXTI3_IRQn)
IRQN_HANDLER(10, EXTI4_IRQn)
IRQN_HANDLER(11, DMA1_Channel1_IRQn)
IRQN_HANDLER(12, DMA1_Channel2_IRQn)
IRQN_HANDLER(13, DMA1_Channel3_IRQn)
IRQN_HANDLER(14, DMA1_Channel4_IRQn)
IRQN_HANDLER(15, DMA1_Channel5_IRQn)
IRQN_HANDLER(16, DMA1_Channel6_IRQn)
IRQN_HANDLER(17, DMA1_Channel7_IRQn)
IRQN_HANDLER(18, ADC1_2_IRQn)
IRQN_HANDLER(19, CAN_TX_IRQn)
IRQN_HANDLER(20, CAN_RX0_IRQn)
IRQN_HANDLER(21, CAN_RX1_IRQn)
IRQN_HANDLER(22, CAN_SCE_IRQn)
IRQN_HANDLER(23, EXTI9_5_IRQn)
IRQN_HANDLER(24, TIM1_BRK_TIM15_IRQn)
IRQN_HANDLER(25, TIM1_UP_TIM16_IRQn)
IRQN_HANDLER(26, TIM1_TRG_COM_TIM17_IRQn)
IRQN_HANDLER(27, TIM1_CC_IRQn)
IRQN_HANDLER(28, TIM2_IRQn)
IRQN_HANDLER(29, TIM3_IRQn)
SKIP_HANLDER(30)
IRQN_HANDLER(31, I2C1_EV_IRQn)
IRQN_HANDLER(32, I2C1_ER_IRQn)
SKIP_HANLDER(33)
SKIP_HANLDER(34)
IRQN_HANDLER(35, SPI1_IRQn)
SKIP_HANLDER(36)
IRQN_HANDLER(37, USART1_IRQn)
IRQN_HANDLER(38, USART2_IRQn)
IRQN_HANDLER(39, USART3_IRQn)
IRQN_HANDLER(40, EXTI15_10_IRQn)
IRQN_HANDLER(41, RTC_Alarm_IRQn)
SKIP_HANLDER(42)
SKIP_HANLDER(43)
SKIP_HANLDER(44)
SKIP_HANLDER(45)
SKIP_HANLDER(46)
SKIP_HANLDER(47)
SKIP_HANLDER(48)
SKIP_HANLDER(49)
SKIP_HANLDER(50)
SKIP_HANLDER(51)
SKIP_HANLDER(52)
SKIP_HANLDER(53)
IRQN_HANDLER(54, TIM6_DAC1_IRQn)
IRQN_HANDLER(55, TIM7_DAC2_IRQn)
SKIP_HANLDER(56)
SKIP_HANLDER(57)
SKIP_HANLDER(58)
SKIP_HANLDER(59)
SKIP_HANLDER(60)
SKIP_HANLDER(61)
SKIP_HANLDER(62)
SKIP_HANLDER(63)
IRQN_HANDLER(64, COMP2_IRQn)
IRQN_HANDLER(65, COMP4_6_IRQn)
SKIP_HANLDER(66)
SKIP_HANLDER(67)
SKIP_HANLDER(68)
SKIP_HANLDER(69)
SKIP_HANLDER(70)
SKIP_HANLDER(71)
SKIP_HANLDER(72)
SKIP_HANLDER(73)
SKIP_HANLDER(74)
SKIP_HANLDER(75)
SKIP_HANLDER(76)
SKIP_HANLDER(77)
SKIP_HANLDER(78)
SKIP_HANLDER(79)
SKIP_HANLDER(80)
IRQN_HANDLER(81, FPU_IRQn)

#endif

